program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1429.0.0"}, {"coremltools-component-torch", "1.13.1"}, {"coremltools-version", "6.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 77]> input_ids) {
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<bool, []>(false)];
            tensor<string, []> cast_1_dtype_0 = const()[name = tensor<string, []>("cast_1_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [49408, 1024]> text_encoder_text_model_embeddings_token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_embeddings_token_embedding_weight_to_fp16"), val = tensor<fp16, [49408, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, [1, 77]> cast_954 = cast(dtype = cast_1_dtype_0, x = input_ids);
            tensor<fp16, [1, 77, 1024]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = cast_954, x = text_encoder_text_model_embeddings_token_embedding_weight_to_fp16);
            tensor<fp16, [1, 77, 1024]> position_embeddings_to_fp16 = const()[name = tensor<string, []>("position_embeddings_to_fp16"), val = tensor<fp16, [1, 77, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101187712)))];
            tensor<fp16, [1, 77, 1024]> input_3_cast = add(x = inputs_embeds_cast, y = position_embeddings_to_fp16);
            tensor<int32, []> band_part_0_lower_0 = const()[name = tensor<string, []>("band_part_0_lower_0"), val = tensor<int32, []>(-1)];
            tensor<int32, []> band_part_0_upper_0 = const()[name = tensor<string, []>("band_part_0_upper_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, 77, 77]> mask_1_to_fp16 = const()[name = tensor<string, []>("mask_1_to_fp16"), val = tensor<fp16, [1, 77, 77]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101345472)))];
            tensor<fp16, [1, 77, 77]> band_part_0_cast = band_part(lower = band_part_0_lower_0, upper = band_part_0_upper_0, x = mask_1_to_fp16);
            tensor<fp16, [1, 77, 77]> mask_cast = sub(x = mask_1_to_fp16, y = band_part_0_cast);
            tensor<int32, [1]> var_44_axes_0 = const()[name = tensor<string, []>("op_44_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 77, 77]> var_44_cast = expand_dims(axes = var_44_axes_0, x = mask_cast);
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101357440)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101359552)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 77, 1024]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_3_cast);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101361664)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103458880)))];
            tensor<fp16, [1, 77, 1024]> var_110_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<fp16, []> var_111_to_fp16 = const()[name = tensor<string, []>("op_111_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_5_cast = mul(x = var_110_cast, y = var_111_to_fp16);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103460992)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(105558208)))];
            tensor<fp16, [1, 77, 1024]> tensor_1_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_117_cast = reshape(shape = var_116, x = tensor_1_cast);
            tensor<int32, [4]> var_118_perm_0 = const()[name = tensor<string, []>("op_118_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(105560320)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107657536)))];
            tensor<fp16, [1, 77, 1024]> tensor_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast);
            tensor<int32, [4]> var_123 = const()[name = tensor<string, []>("op_123"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_124_cast = reshape(shape = var_123, x = tensor_3_cast);
            tensor<int32, [4]> var_125_perm_0 = const()[name = tensor<string, []>("op_125_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_132 = const()[name = tensor<string, []>("op_132"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_133_cast = reshape(shape = var_132, x = tensor_5_cast);
            tensor<int32, [4]> var_134_perm_0 = const()[name = tensor<string, []>("op_134_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_113 = transpose(perm = var_134_perm_0, x = var_133_cast);
            tensor<fp16, [16, 77, 64]> query_states_1_cast = reshape(shape = var_136, x = transpose_113);
            tensor<int32, [3]> var_138 = const()[name = tensor<string, []>("op_138"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_115 = transpose(perm = var_118_perm_0, x = var_117_cast);
            tensor<fp16, [16, 77, 64]> key_states_3_cast = reshape(shape = var_138, x = transpose_115);
            tensor<int32, [3]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_114 = transpose(perm = var_125_perm_0, x = var_124_cast);
            tensor<fp16, [16, 77, 64]> value_states_3_cast = reshape(shape = var_140, x = transpose_114);
            tensor<int32, [3]> var_143_perm_0 = const()[name = tensor<string, []>("op_143_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_112 = transpose(perm = var_143_perm_0, x = key_states_3_cast);
            tensor<fp16, [16, 77, 77]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_112);
            tensor<int32, [4]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_146_cast = reshape(shape = var_145, x = attn_weights_1_cast);
            tensor<fp16, [1, 16, 77, 77]> attn_weights_3_cast = add(x = var_146_cast, y = var_44_cast);
            tensor<int32, [3]> var_151 = const()[name = tensor<string, []>("op_151"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_5_cast = reshape(shape = var_151, x = attn_weights_3_cast);
            tensor<fp16, [16, 77, 77]> input_7_cast = softmax(axis = var_5, x = input_5_cast);
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast);
            tensor<int32, [4]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_3_cast = reshape(shape = var_156, x = attn_output_1_cast);
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_111 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast);
            tensor<fp16, [1, 77, 1024]> input_9_cast = reshape(shape = var_159, x = transpose_111);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107659648)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109756864)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast);
            tensor<fp16, [1, 77, 1024]> input_11_cast = add(x = input_3_cast, y = hidden_states_3_cast);
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109758976)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109761088)))];
            tensor<fp16, [1, 77, 1024]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast);
            tensor<fp16, [4096, 1024]> text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109763200)))];
            tensor<fp16, [4096]> text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118151872)))];
            tensor<fp16, [1, 77, 4096]> input_15_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_13_cast);
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 4096]> input_17_cast = gelu(mode = input_17_mode_0, x = input_15_cast);
            tensor<fp16, [1024, 4096]> text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(118160128)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126548800)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_5_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_17_cast);
            tensor<fp16, [1, 77, 1024]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast);
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126550912)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126553024)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126555136)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(128652352)))];
            tensor<fp16, [1, 77, 1024]> var_197_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<fp16, []> var_198_to_fp16 = const()[name = tensor<string, []>("op_198_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_11_cast = mul(x = var_197_cast, y = var_198_to_fp16);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(128654464)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(130751680)))];
            tensor<fp16, [1, 77, 1024]> tensor_7_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_204_cast = reshape(shape = var_203, x = tensor_7_cast);
            tensor<int32, [4]> var_205_perm_0 = const()[name = tensor<string, []>("op_205_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(130753792)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132851008)))];
            tensor<fp16, [1, 77, 1024]> tensor_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast);
            tensor<int32, [4]> var_210 = const()[name = tensor<string, []>("op_210"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_211_cast = reshape(shape = var_210, x = tensor_9_cast);
            tensor<int32, [4]> var_212_perm_0 = const()[name = tensor<string, []>("op_212_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_219 = const()[name = tensor<string, []>("op_219"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_220_cast = reshape(shape = var_219, x = tensor_11_cast);
            tensor<int32, [4]> var_221_perm_0 = const()[name = tensor<string, []>("op_221_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_108 = transpose(perm = var_221_perm_0, x = var_220_cast);
            tensor<fp16, [16, 77, 64]> query_states_3_cast = reshape(shape = var_223, x = transpose_108);
            tensor<int32, [3]> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_110 = transpose(perm = var_205_perm_0, x = var_204_cast);
            tensor<fp16, [16, 77, 64]> key_states_7_cast = reshape(shape = var_225, x = transpose_110);
            tensor<int32, [3]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_109 = transpose(perm = var_212_perm_0, x = var_211_cast);
            tensor<fp16, [16, 77, 64]> value_states_7_cast = reshape(shape = var_227, x = transpose_109);
            tensor<int32, [3]> var_230_perm_0 = const()[name = tensor<string, []>("op_230_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_7_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_107 = transpose(perm = var_230_perm_0, x = key_states_7_cast);
            tensor<fp16, [16, 77, 77]> attn_weights_7_cast = matmul(transpose_x = attn_weights_7_transpose_x_0, transpose_y = attn_weights_7_transpose_y_0, x = query_states_3_cast, y = transpose_107);
            tensor<int32, [4]> var_232 = const()[name = tensor<string, []>("op_232"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_233_cast = reshape(shape = var_232, x = attn_weights_7_cast);
            tensor<fp16, [1, 16, 77, 77]> attn_weights_9_cast = add(x = var_233_cast, y = var_44_cast);
            tensor<int32, [3]> var_238 = const()[name = tensor<string, []>("op_238"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_21_cast = reshape(shape = var_238, x = attn_weights_9_cast);
            tensor<fp16, [16, 77, 77]> input_23_cast = softmax(axis = var_5, x = input_21_cast);
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_23_cast, y = value_states_7_cast);
            tensor<int32, [4]> var_243 = const()[name = tensor<string, []>("op_243"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_9_cast = reshape(shape = var_243, x = attn_output_7_cast);
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_106 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast);
            tensor<fp16, [1, 77, 1024]> input_25_cast = reshape(shape = var_246, x = transpose_106);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132853120)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134950336)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_25_cast);
            tensor<fp16, [1, 77, 1024]> input_27_cast = add(x = input_19_cast, y = hidden_states_9_cast);
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134952448)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134954560)))];
            tensor<fp16, [1, 77, 1024]> input_29_cast = layer_norm(axes = input_29_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_27_cast);
            tensor<fp16, [4096, 1024]> text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134956672)))];
            tensor<fp16, [4096]> text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(143345344)))];
            tensor<fp16, [1, 77, 4096]> input_31_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_29_cast);
            tensor<string, []> input_33_mode_0 = const()[name = tensor<string, []>("input_33_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 4096]> input_33_cast = gelu(mode = input_33_mode_0, x = input_31_cast);
            tensor<fp16, [1024, 4096]> text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(143353600)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151742272)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_11_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_33_cast);
            tensor<fp16, [1, 77, 1024]> input_35_cast = add(x = input_27_cast, y = hidden_states_11_cast);
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151744384)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151746496)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_35_cast);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151748608)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153845824)))];
            tensor<fp16, [1, 77, 1024]> var_284_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<fp16, []> var_285_to_fp16 = const()[name = tensor<string, []>("op_285_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_17_cast = mul(x = var_284_cast, y = var_285_to_fp16);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153847936)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155945152)))];
            tensor<fp16, [1, 77, 1024]> tensor_13_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_291_cast = reshape(shape = var_290, x = tensor_13_cast);
            tensor<int32, [4]> var_292_perm_0 = const()[name = tensor<string, []>("op_292_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155947264)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(158044480)))];
            tensor<fp16, [1, 77, 1024]> tensor_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast);
            tensor<int32, [4]> var_297 = const()[name = tensor<string, []>("op_297"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_298_cast = reshape(shape = var_297, x = tensor_15_cast);
            tensor<int32, [4]> var_299_perm_0 = const()[name = tensor<string, []>("op_299_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_307_cast = reshape(shape = var_306, x = tensor_17_cast);
            tensor<int32, [4]> var_308_perm_0 = const()[name = tensor<string, []>("op_308_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_103 = transpose(perm = var_308_perm_0, x = var_307_cast);
            tensor<fp16, [16, 77, 64]> query_states_5_cast = reshape(shape = var_310, x = transpose_103);
            tensor<int32, [3]> var_312 = const()[name = tensor<string, []>("op_312"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_105 = transpose(perm = var_292_perm_0, x = var_291_cast);
            tensor<fp16, [16, 77, 64]> key_states_11_cast = reshape(shape = var_312, x = transpose_105);
            tensor<int32, [3]> var_314 = const()[name = tensor<string, []>("op_314"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_104 = transpose(perm = var_299_perm_0, x = var_298_cast);
            tensor<fp16, [16, 77, 64]> value_states_11_cast = reshape(shape = var_314, x = transpose_104);
            tensor<int32, [3]> var_317_perm_0 = const()[name = tensor<string, []>("op_317_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_13_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_102 = transpose(perm = var_317_perm_0, x = key_states_11_cast);
            tensor<fp16, [16, 77, 77]> attn_weights_13_cast = matmul(transpose_x = attn_weights_13_transpose_x_0, transpose_y = attn_weights_13_transpose_y_0, x = query_states_5_cast, y = transpose_102);
            tensor<int32, [4]> var_319 = const()[name = tensor<string, []>("op_319"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_320_cast = reshape(shape = var_319, x = attn_weights_13_cast);
            tensor<fp16, [1, 16, 77, 77]> attn_weights_15_cast = add(x = var_320_cast, y = var_44_cast);
            tensor<int32, [3]> var_325 = const()[name = tensor<string, []>("op_325"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_37_cast = reshape(shape = var_325, x = attn_weights_15_cast);
            tensor<fp16, [16, 77, 77]> input_39_cast = softmax(axis = var_5, x = input_37_cast);
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast, y = value_states_11_cast);
            tensor<int32, [4]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_15_cast = reshape(shape = var_330, x = attn_output_13_cast);
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_333 = const()[name = tensor<string, []>("op_333"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_101 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast);
            tensor<fp16, [1, 77, 1024]> input_41_cast = reshape(shape = var_333, x = transpose_101);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(158046592)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(160143808)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = input_41_cast);
            tensor<fp16, [1, 77, 1024]> input_43_cast = add(x = input_35_cast, y = hidden_states_15_cast);
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(160145920)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(160148032)))];
            tensor<fp16, [1, 77, 1024]> input_45_cast = layer_norm(axes = input_45_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_43_cast);
            tensor<fp16, [4096, 1024]> text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [4096, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(160150144)))];
            tensor<fp16, [4096]> text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(168538816)))];
            tensor<fp16, [1, 77, 4096]> input_47_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_45_cast);
            tensor<string, []> input_49_mode_0 = const()[name = tensor<string, []>("input_49_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 4096]> input_49_cast = gelu(mode = input_49_mode_0, x = input_47_cast);
            tensor<fp16, [1024, 4096]> text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1024, 4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(168547072)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(176935744)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_17_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_49_cast);
            tensor<fp16, [1, 77, 1024]> input_51_cast = add(x = input_43_cast, y = hidden_states_17_cast);
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(176937856)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(176939968)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_19_cast = layer_norm(axes = hidden_states_19_axes_0, beta = text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_51_cast);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(176942080)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179039296)))];
            tensor<fp16, [1, 77, 1024]> var_371_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<fp16, []> var_372_to_fp16 = const()[name = tensor<string, []>("op_372_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_23_cast = mul(x = var_371_cast, y = var_372_to_fp16);
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179041408)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181138624)))];
            tensor<fp16, [1, 77, 1024]> tensor_19_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_377 = const()[name = tensor<string, []>("op_377"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_378_cast = reshape(shape = var_377, x = tensor_19_cast);
            tensor<int32, [4]> var_379_perm_0 = const()[name = tensor<string, []>("op_379_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1024, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181140736)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(183237952)))];
            tensor<fp16, [1, 77, 1024]> tensor_21_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16, x = hidden_states_19_cast);
            tensor<int32, [4]> var_384 = const()[name = tensor<string, []>("op_384"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_385_cast = reshape(shape = var_384, x = tensor_21_cast);
            tensor<int32, [4]> var_386_perm_0 = const()[name = tensor<string, []>("op_386_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_394_cast = reshape(shape = var_393, x = tensor_23_cast);
            tensor<int32, [4]> var_395_perm_0 = const()[name = tensor<string, []>("op_395_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_397 = const()[name = tensor<string, []>("op_397"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_98 = transpose(perm = var_395_perm_0, x = var_394_cast);
            tensor<fp16, [16, 77, 64]> query_states_7_cast = reshape(shape = var_397, x = transpose_98);
            tensor<int32, [3]> var_399 = const()[name = tensor<string, []>("op_399"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_100 = transpose(perm = var_379_perm_0, x = var_378_cast);
