program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "4.28.4"}, {"coremlc-version", "1429.0.0"}, {"coremltools-component-torch", "1.13.1"}, {"coremltools-version", "6.1"}})]
{
    func main<ios16>(tensor<fp16, [1, 4, 64, 64]> z) {
            tensor<int32, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_10 = const()[name = tensor<string, []>("op_10"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_12 = const()[name = tensor<string, []>("op_12"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [4, 4, 1, 1]> post_quant_conv_weight_to_fp16 = const()[name = tensor<string, []>("post_quant_conv_weight_to_fp16"), val = tensor<fp16, [4, 4, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [4]> post_quant_conv_bias_to_fp16 = const()[name = tensor<string, []>("post_quant_conv_bias_to_fp16"), val = tensor<fp16, [4]>([0x1.06cp-5, -0x1.594p-4, -0x1.f24p-3, 0x1.0d8p-3])];
            tensor<fp16, [1, 4, 64, 64]> input_1_cast = conv(bias = post_quant_conv_bias_to_fp16, dilations = var_12, groups = var_7, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_10, weight = post_quant_conv_weight_to_fp16, x = z);
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_28 = const()[name = tensor<string, []>("op_28"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_46 = const()[name = tensor<string, []>("op_46"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_48 = const()[name = tensor<string, []>("op_48"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 4, 3, 3]> decoder_conv_in_weight_to_fp16 = const()[name = tensor<string, []>("decoder_conv_in_weight_to_fp16"), val = tensor<fp16, [512, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192)))];
            tensor<fp16, [512]> decoder_conv_in_bias_to_fp16 = const()[name = tensor<string, []>("decoder_conv_in_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(37120)))];
            tensor<fp16, [1, 512, 64, 64]> input_3_cast = conv(bias = decoder_conv_in_bias_to_fp16, dilations = var_48, groups = var_28, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_46, weight = decoder_conv_in_weight_to_fp16, x = input_1_cast);
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_3_cast);
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_0_cast = square(x = sub_0_cast);
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast);
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast);
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast);
            tensor<fp16, [512]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38208)))];
            tensor<fp16, [512]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39296)))];
            tensor<fp16, [512]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(40384)))];
            tensor<fp16, [512]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41472)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast);
            tensor<fp16, [1, 512, 64, 64]> input_7_cast = silu(x = add_1_cast);
            tensor<int32, [2]> var_67 = const()[name = tensor<string, []>("op_67"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_mid_block_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42560)))];
            tensor<fp16, [512]> decoder_mid_block_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4761216)))];
            tensor<fp16, [1, 512, 64, 64]> input_9_cast = conv(bias = decoder_mid_block_resnets_0_conv1_bias_to_fp16, dilations = var_69, groups = var_28, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_67, weight = decoder_mid_block_resnets_0_conv1_weight_to_fp16, x = input_7_cast);
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_9_cast);
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_1_cast = square(x = sub_2_cast);
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast);
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast);
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast);
            tensor<fp16, [512]> add_3_mean_0_to_fp16 = const()[name = tensor<string, []>("add_3_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4762304)))];
            tensor<fp16, [512]> add_3_variance_0_to_fp16 = const()[name = tensor<string, []>("add_3_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4763392)))];
            tensor<fp16, [512]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4764480)))];
            tensor<fp16, [512]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4765568)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_3_mean_0_to_fp16, variance = add_3_variance_0_to_fp16, x = reshape_5_cast);
            tensor<fp16, [1, 512, 64, 64]> input_13_cast = silu(x = add_3_cast);
            tensor<int32, [2]> var_79 = const()[name = tensor<string, []>("op_79"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_81 = const()[name = tensor<string, []>("op_81"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_mid_block_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4766656)))];
            tensor<fp16, [512]> decoder_mid_block_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9485312)))];
            tensor<fp16, [1, 512, 64, 64]> hidden_states_1_cast = conv(bias = decoder_mid_block_resnets_0_conv2_bias_to_fp16, dilations = var_81, groups = var_28, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_79, weight = decoder_mid_block_resnets_0_conv2_weight_to_fp16, x = input_13_cast);
            tensor<fp16, [1, 512, 64, 64]> var_84_cast = add(x = input_3_cast, y = hidden_states_1_cast);
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = var_84_cast);
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_2_cast = square(x = sub_4_cast);
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast);
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast);
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast);
            tensor<fp16, [512]> add_5_mean_0_to_fp16 = const()[name = tensor<string, []>("add_5_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9486400)))];
            tensor<fp16, [512]> add_5_variance_0_to_fp16 = const()[name = tensor<string, []>("add_5_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9487488)))];
            tensor<fp16, [512]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9488576)))];
            tensor<fp16, [512]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9489664)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_5_mean_0_to_fp16, variance = add_5_variance_0_to_fp16, x = reshape_9_cast);
            tensor<int32, [3]> var_103 = const()[name = tensor<string, []>("op_103"), val = tensor<int32, [3]>([1, 512, 4096])];
            tensor<fp16, [1, 512, 4096]> var_104_cast = reshape(shape = var_103, x = add_5_cast);
            tensor<int32, [3]> input_17_perm_0 = const()[name = tensor<string, []>("input_17_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [512, 512]> decoder_mid_block_attentions_0_query_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_query_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9490752)))];
            tensor<fp16, [512]> decoder_mid_block_attentions_0_query_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_query_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10015104)))];
            tensor<fp16, [1, 4096, 512]> transpose_6 = transpose(perm = input_17_perm_0, x = var_104_cast);
            tensor<fp16, [1, 4096, 512]> tensor_1_cast = linear(bias = decoder_mid_block_attentions_0_query_bias_to_fp16, weight = decoder_mid_block_attentions_0_query_weight_to_fp16, x = transpose_6);
            tensor<fp16, [512, 512]> decoder_mid_block_attentions_0_key_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_key_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10016192)))];
            tensor<fp16, [512]> decoder_mid_block_attentions_0_key_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_key_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10540544)))];
            tensor<fp16, [1, 4096, 512]> tensor_5_cast = linear(bias = decoder_mid_block_attentions_0_key_bias_to_fp16, weight = decoder_mid_block_attentions_0_key_weight_to_fp16, x = transpose_6);
            tensor<fp16, [512, 512]> decoder_mid_block_attentions_0_value_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_value_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10541632)))];
            tensor<fp16, [512]> decoder_mid_block_attentions_0_value_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11065984)))];
            tensor<fp16, [1, 4096, 512]> tensor_9_cast = linear(bias = decoder_mid_block_attentions_0_value_bias_to_fp16, weight = decoder_mid_block_attentions_0_value_weight_to_fp16, x = transpose_6);
            tensor<int32, [4]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [4]>([1, 4096, 1, 512])];
            tensor<fp16, [1, 4096, 1, 512]> tensor_3_cast = reshape(shape = var_122, x = tensor_1_cast);
            tensor<int32, [4]> var_124 = const()[name = tensor<string, []>("op_124"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, [3]>([1, 4096, 512])];
            tensor<fp16, [1, 1, 4096, 512]> transpose_5 = transpose(perm = var_124, x = tensor_3_cast);
            tensor<fp16, [1, 4096, 512]> query_proj_cast = reshape(shape = var_131, x = transpose_5);
            tensor<int32, [4]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [4]>([1, 4096, 1, 512])];
            tensor<fp16, [1, 4096, 1, 512]> tensor_7_cast = reshape(shape = var_140, x = tensor_5_cast);
            tensor<int32, [4]> var_142 = const()[name = tensor<string, []>("op_142"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_149 = const()[name = tensor<string, []>("op_149"), val = tensor<int32, [3]>([1, 4096, 512])];
            tensor<fp16, [1, 1, 4096, 512]> transpose_4 = transpose(perm = var_142, x = tensor_7_cast);
            tensor<fp16, [1, 4096, 512]> key_proj_cast = reshape(shape = var_149, x = transpose_4);
            tensor<int32, [4]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [4]>([1, 4096, 1, 512])];
            tensor<fp16, [1, 4096, 1, 512]> tensor_11_cast = reshape(shape = var_158, x = tensor_9_cast);
            tensor<int32, [4]> var_160 = const()[name = tensor<string, []>("op_160"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [3]>([1, 4096, 512])];
            tensor<fp16, [1, 1, 4096, 512]> transpose_3 = transpose(perm = var_160, x = tensor_11_cast);
            tensor<fp16, [1, 4096, 512]> value_proj_cast = reshape(shape = var_167, x = transpose_3);
            tensor<int32, [3]> var_174_perm_0 = const()[name = tensor<string, []>("op_174_perm_0"), val = tensor<int32, [3]>([0, -1, -2])];
            tensor<fp16, []> var_20_to_fp16 = const()[name = tensor<string, []>("op_20_to_fp16"), val = tensor<fp16, []>(0x1.6ap-5)];
            tensor<fp16, [1, 4096, 512]> query_proj_scaled_cast = mul(x = var_20_to_fp16, y = query_proj_cast);
            tensor<bool, []> attention_scores_1_bmm_transpose_x_0 = const()[name = tensor<string, []>("attention_scores_1_bmm_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attention_scores_1_bmm_transpose_y_0 = const()[name = tensor<string, []>("attention_scores_1_bmm_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 4096]> transpose_2 = transpose(perm = var_174_perm_0, x = key_proj_cast);
            tensor<fp16, [1, 4096, 4096]> attention_scores_1_bmm_cast = matmul(transpose_x = attention_scores_1_bmm_transpose_x_0, transpose_y = attention_scores_1_bmm_transpose_y_0, x = query_proj_scaled_cast, y = transpose_2);
            tensor<fp16, [1, 4096, 4096]> var_177_cast = softmax(axis = var_22, x = attention_scores_1_bmm_cast);
            tensor<bool, []> tensor_13_transpose_x_0 = const()[name = tensor<string, []>("tensor_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> tensor_13_transpose_y_0 = const()[name = tensor<string, []>("tensor_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4096, 512]> tensor_13_cast = matmul(transpose_x = tensor_13_transpose_x_0, transpose_y = tensor_13_transpose_y_0, x = var_177_cast, y = value_proj_cast);
            tensor<int32, [4]> var_187 = const()[name = tensor<string, []>("op_187"), val = tensor<int32, [4]>([1, 1, 4096, 512])];
            tensor<fp16, [1, 1, 4096, 512]> tensor_cast = reshape(shape = var_187, x = tensor_13_cast);
            tensor<int32, [4]> var_189 = const()[name = tensor<string, []>("op_189"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [3]>([1, 4096, 512])];
            tensor<fp16, [1, 4096, 1, 512]> transpose_1 = transpose(perm = var_189, x = tensor_cast);
            tensor<fp16, [1, 4096, 512]> input_19_cast = reshape(shape = var_196, x = transpose_1);
            tensor<fp16, [512, 512]> decoder_mid_block_attentions_0_proj_attn_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_proj_attn_weight_to_fp16"), val = tensor<fp16, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11067072)))];
            tensor<fp16, [512]> decoder_mid_block_attentions_0_proj_attn_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_proj_attn_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11591424)))];
            tensor<fp16, [1, 4096, 512]> hidden_states_7_cast = linear(bias = decoder_mid_block_attentions_0_proj_attn_bias_to_fp16, weight = decoder_mid_block_attentions_0_proj_attn_weight_to_fp16, x = input_19_cast);
            tensor<int32, [3]> var_201_perm_0 = const()[name = tensor<string, []>("op_201_perm_0"), val = tensor<int32, [3]>([0, -1, -2])];
            tensor<int32, [4]> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 4096]> transpose_0 = transpose(perm = var_201_perm_0, x = hidden_states_7_cast);
            tensor<fp16, [1, 512, 64, 64]> hidden_states_9_cast = reshape(shape = var_202, x = transpose_0);
            tensor<fp16, [1, 512, 64, 64]> var_204_cast = add(x = hidden_states_9_cast, y = var_84_cast);
            tensor<int32, [5]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_12_cast = reshape(shape = reshape_12_shape_0, x = var_204_cast);
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_9_cast = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_6_cast = sub(x = reshape_12_cast, y = reduce_mean_9_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_3_cast = square(x = sub_6_cast);
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_11_cast = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast);
            tensor<fp16, []> add_6_y_0_to_fp16 = const()[name = tensor<string, []>("add_6_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_6_cast = add(x = reduce_mean_11_cast, y = add_6_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_3_cast = sqrt(x = add_6_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_3_cast = real_div(x = sub_6_cast, y = sqrt_3_cast);
            tensor<int32, [4]> reshape_13_shape_0 = const()[name = tensor<string, []>("reshape_13_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_13_cast = reshape(shape = reshape_13_shape_0, x = real_div_3_cast);
            tensor<fp16, [512]> add_7_mean_0_to_fp16 = const()[name = tensor<string, []>("add_7_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11592512)))];
            tensor<fp16, [512]> add_7_variance_0_to_fp16 = const()[name = tensor<string, []>("add_7_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11593600)))];
            tensor<fp16, [512]> add_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_7_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11594688)))];
            tensor<fp16, [512]> add_7_beta_0_to_fp16 = const()[name = tensor<string, []>("add_7_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11595776)))];
            tensor<fp16, []> add_7_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_7_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_7_cast = batch_norm(beta = add_7_beta_0_to_fp16, epsilon = add_7_epsilon_0_to_fp16, gamma = add_7_gamma_0_to_fp16, mean = add_7_mean_0_to_fp16, variance = add_7_variance_0_to_fp16, x = reshape_13_cast);
            tensor<fp16, [1, 512, 64, 64]> input_25_cast = silu(x = add_7_cast);
            tensor<int32, [2]> var_217 = const()[name = tensor<string, []>("op_217"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_219 = const()[name = tensor<string, []>("op_219"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_mid_block_resnets_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv1_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11596864)))];
            tensor<fp16, [512]> decoder_mid_block_resnets_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16315520)))];
            tensor<fp16, [1, 512, 64, 64]> input_27_cast = conv(bias = decoder_mid_block_resnets_1_conv1_bias_to_fp16, dilations = var_219, groups = var_28, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = var_217, weight = decoder_mid_block_resnets_1_conv1_weight_to_fp16, x = input_25_cast);
            tensor<int32, [5]> reshape_16_shape_0 = const()[name = tensor<string, []>("reshape_16_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_16_cast = reshape(shape = reshape_16_shape_0, x = input_27_cast);
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_12_cast = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_8_cast = sub(x = reshape_16_cast, y = reduce_mean_12_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_4_cast = square(x = sub_8_cast);
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_14_cast = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast);
            tensor<fp16, []> add_8_y_0_to_fp16 = const()[name = tensor<string, []>("add_8_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_8_cast = add(x = reduce_mean_14_cast, y = add_8_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_4_cast = sqrt(x = add_8_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_4_cast = real_div(x = sub_8_cast, y = sqrt_4_cast);
            tensor<int32, [4]> reshape_17_shape_0 = const()[name = tensor<string, []>("reshape_17_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_17_cast = reshape(shape = reshape_17_shape_0, x = real_div_4_cast);
            tensor<fp16, [512]> add_9_mean_0_to_fp16 = const()[name = tensor<string, []>("add_9_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16316608)))];
            tensor<fp16, [512]> add_9_variance_0_to_fp16 = const()[name = tensor<string, []>("add_9_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16317696)))];
            tensor<fp16, [512]> add_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_9_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16318784)))];
            tensor<fp16, [512]> add_9_beta_0_to_fp16 = const()[name = tensor<string, []>("add_9_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16319872)))];
            tensor<fp16, []> add_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_9_cast = batch_norm(beta = add_9_beta_0_to_fp16, epsilon = add_9_epsilon_0_to_fp16, gamma = add_9_gamma_0_to_fp16, mean = add_9_mean_0_to_fp16, variance = add_9_variance_0_to_fp16, x = reshape_17_cast);
            tensor<fp16, [1, 512, 64, 64]> input_31_cast = silu(x = add_9_cast);
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_11_pad_type_0 = const()[name = tensor<string, []>("hidden_states_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_11_pad_0 = const()[name = tensor<string, []>("hidden_states_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_mid_block_resnets_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv2_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16320960)))];
            tensor<fp16, [512]> decoder_mid_block_resnets_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21039616)))];
            tensor<fp16, [1, 512, 64, 64]> hidden_states_11_cast = conv(bias = decoder_mid_block_resnets_1_conv2_bias_to_fp16, dilations = var_231, groups = var_28, pad = hidden_states_11_pad_0, pad_type = hidden_states_11_pad_type_0, strides = var_229, weight = decoder_mid_block_resnets_1_conv2_weight_to_fp16, x = input_31_cast);
            tensor<fp16, [1, 512, 64, 64]> var_234_cast = add(x = var_204_cast, y = hidden_states_11_cast);
            tensor<int32, [5]> reshape_20_shape_0 = const()[name = tensor<string, []>("reshape_20_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_20_cast = reshape(shape = reshape_20_shape_0, x = var_234_cast);
            tensor<int32, [3]> reduce_mean_15_axes_0 = const()[name = tensor<string, []>("reduce_mean_15_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_15_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_15_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_15_cast = reduce_mean(axes = reduce_mean_15_axes_0, keep_dims = reduce_mean_15_keep_dims_0, x = reshape_20_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_10_cast = sub(x = reshape_20_cast, y = reduce_mean_15_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_5_cast = square(x = sub_10_cast);
            tensor<int32, [3]> reduce_mean_17_axes_0 = const()[name = tensor<string, []>("reduce_mean_17_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_17_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_17_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_17_cast = reduce_mean(axes = reduce_mean_17_axes_0, keep_dims = reduce_mean_17_keep_dims_0, x = square_5_cast);
            tensor<fp16, []> add_10_y_0_to_fp16 = const()[name = tensor<string, []>("add_10_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_10_cast = add(x = reduce_mean_17_cast, y = add_10_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_5_cast = sqrt(x = add_10_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_5_cast = real_div(x = sub_10_cast, y = sqrt_5_cast);
            tensor<int32, [4]> reshape_21_shape_0 = const()[name = tensor<string, []>("reshape_21_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_21_cast = reshape(shape = reshape_21_shape_0, x = real_div_5_cast);
            tensor<fp16, [512]> add_11_mean_0_to_fp16 = const()[name = tensor<string, []>("add_11_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21040704)))];
            tensor<fp16, [512]> add_11_variance_0_to_fp16 = const()[name = tensor<string, []>("add_11_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21041792)))];
            tensor<fp16, [512]> add_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_11_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21042880)))];
            tensor<fp16, [512]> add_11_beta_0_to_fp16 = const()[name = tensor<string, []>("add_11_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21043968)))];
            tensor<fp16, []> add_11_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_11_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_11_cast = batch_norm(beta = add_11_beta_0_to_fp16, epsilon = add_11_epsilon_0_to_fp16, gamma = add_11_gamma_0_to_fp16, mean = add_11_mean_0_to_fp16, variance = add_11_variance_0_to_fp16, x = reshape_21_cast);
            tensor<fp16, [1, 512, 64, 64]> input_39_cast = silu(x = add_11_cast);
            tensor<int32, [2]> var_255 = const()[name = tensor<string, []>("op_255"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21045056)))];
            tensor<fp16, [512]> decoder_up_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25763712)))];
            tensor<fp16, [1, 512, 64, 64]> input_41_cast = conv(bias = decoder_up_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_257, groups = var_28, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_255, weight = decoder_up_blocks_0_resnets_0_conv1_weight_to_fp16, x = input_39_cast);
            tensor<int32, [5]> reshape_24_shape_0 = const()[name = tensor<string, []>("reshape_24_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_24_cast = reshape(shape = reshape_24_shape_0, x = input_41_cast);
            tensor<int32, [3]> reduce_mean_18_axes_0 = const()[name = tensor<string, []>("reduce_mean_18_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_18_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_18_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_18_cast = reduce_mean(axes = reduce_mean_18_axes_0, keep_dims = reduce_mean_18_keep_dims_0, x = reshape_24_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_12_cast = sub(x = reshape_24_cast, y = reduce_mean_18_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_6_cast = square(x = sub_12_cast);
            tensor<int32, [3]> reduce_mean_20_axes_0 = const()[name = tensor<string, []>("reduce_mean_20_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_20_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_20_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_20_cast = reduce_mean(axes = reduce_mean_20_axes_0, keep_dims = reduce_mean_20_keep_dims_0, x = square_6_cast);
            tensor<fp16, []> add_12_y_0_to_fp16 = const()[name = tensor<string, []>("add_12_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_12_cast = add(x = reduce_mean_20_cast, y = add_12_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_6_cast = sqrt(x = add_12_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_6_cast = real_div(x = sub_12_cast, y = sqrt_6_cast);
            tensor<int32, [4]> reshape_25_shape_0 = const()[name = tensor<string, []>("reshape_25_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_25_cast = reshape(shape = reshape_25_shape_0, x = real_div_6_cast);
            tensor<fp16, [512]> add_13_mean_0_to_fp16 = const()[name = tensor<string, []>("add_13_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25764800)))];
            tensor<fp16, [512]> add_13_variance_0_to_fp16 = const()[name = tensor<string, []>("add_13_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25765888)))];
            tensor<fp16, [512]> add_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_13_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25766976)))];
            tensor<fp16, [512]> add_13_beta_0_to_fp16 = const()[name = tensor<string, []>("add_13_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25768064)))];
            tensor<fp16, []> add_13_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_13_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 512, 64, 64]> add_13_cast = batch_norm(beta = add_13_beta_0_to_fp16, epsilon = add_13_epsilon_0_to_fp16, gamma = add_13_gamma_0_to_fp16, mean = add_13_mean_0_to_fp16, variance = add_13_variance_0_to_fp16, x = reshape_25_cast);
            tensor<fp16, [1, 512, 64, 64]> input_45_cast = silu(x = add_13_cast);
            tensor<int32, [2]> var_267 = const()[name = tensor<string, []>("op_267"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_13_pad_type_0 = const()[name = tensor<string, []>("hidden_states_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_13_pad_0 = const()[name = tensor<string, []>("hidden_states_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25769152)))];
            tensor<fp16, [512]> decoder_up_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30487808)))];
            tensor<fp16, [1, 512, 64, 64]> hidden_states_13_cast = conv(bias = decoder_up_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_269, groups = var_28, pad = hidden_states_13_pad_0, pad_type = hidden_states_13_pad_type_0, strides = var_267, weight = decoder_up_blocks_0_resnets_0_conv2_weight_to_fp16, x = input_45_cast);
            tensor<fp16, [1, 512, 64, 64]> var_272_cast = add(x = var_234_cast, y = hidden_states_13_cast);
            tensor<int32, [5]> reshape_28_shape_0 = const()[name = tensor<string, []>("reshape_28_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 64, 64])];
            tensor<fp16, [1, 32, 16, 64, 64]> reshape_28_cast = reshape(shape = reshape_28_shape_0, x = var_272_cast);
            tensor<int32, [3]> reduce_mean_21_axes_0 = const()[name = tensor<string, []>("reduce_mean_21_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_21_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_21_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_21_cast = reduce_mean(axes = reduce_mean_21_axes_0, keep_dims = reduce_mean_21_keep_dims_0, x = reshape_28_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> sub_14_cast = sub(x = reshape_28_cast, y = reduce_mean_21_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> square_7_cast = square(x = sub_14_cast);
            tensor<int32, [3]> reduce_mean_23_axes_0 = const()[name = tensor<string, []>("reduce_mean_23_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_23_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_23_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_23_cast = reduce_mean(axes = reduce_mean_23_axes_0, keep_dims = reduce_mean_23_keep_dims_0, x = square_7_cast);
            tensor<fp16, []> add_14_y_0_to_fp16 = const()[name = tensor<string, []>("add_14_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_14_cast = add(x = reduce_mean_23_cast, y = add_14_y_0_to_fp16);
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_7_cast = sqrt(x = add_14_cast);
            tensor<fp16, [1, 32, 16, 64, 64]> real_div_7_cast = real_div(x = sub_14_cast, y = sqrt_7_cast);
            tensor<int32, [4]> reshape_29_shape_0 = const()[name = tensor<string, []>("reshape_29_shape_0"), val = tensor<int32, [4]>([1, 512, 64, 64])];
            tensor<fp16, [1, 512, 64, 64]> reshape_29_cast = reshape(shape = reshape_29_shape_0, x = real_div_7_cast);
            tensor<fp16, [512]> add_15_mean_0_to_fp16 = const()[name = tensor<string, []>("add_15_mean_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30488896)))];
            tensor<fp16, [512]> add_15_variance_0_to_fp16 = const()[name = tensor<string, []>("add_15_variance_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30489984)))];
            tensor<fp16, [512]> add_15_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_15_gamma_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30491072)))];
            tensor<fp16, [512]> add_15_beta_0_to_fp16 = const()[name = tensor<string, []>("add_15_beta_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30492160)))];
